In [1]:
import pandas as pd

url = "https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"

df = pd.read_csv(url)

In [2]:
df.head()

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [4]:
df.max()

Name            Japan
People      208360000
Area          9984670
BIP              4938
Currency          YEN
dtype: object

In [5]:
df.min()

Name        Brazilia
People      36503097
Area          301338
BIP             1529
Currency         CAD
dtype: object

In [6]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [7]:
df[df.Currency == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [8]:
newDataframe = df.filter(items=['Name', 'Currency']).copy()
newDataframe.head()

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [9]:
df.loc[df['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [10]:
df.loc[(df['People'] > 5*(10**7)) & (df['People'] < 15*(10**7))]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [11]:
df.rename(columns={'BIP':'Bip'})

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [12]:
newDf = df.rename(columns={'BIP':'Bip'}).copy()
newDf['Bip'].sum(axis=0)

13581

In [13]:
df['People'].mean(axis=0)

102786293.6

In [14]:
df.sort_values('Name', axis=0, ascending=True)

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [15]:
import numpy as np
newDf = df.copy()
newDf['Area'] = np.where(newDf['Area']>=1000000, 'BIG', 'SMALL')
newDf.head()

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL